[
    {
        "Title": "Asian Beef with Snow Peas",
        "Title_link": "https://www.allrecipes.com/recipe/15679/asian-beef-with-snow-peas/?internalSource=hub recipe&referringId=695&referringContentType=Recipe Hub",
        "Headline": "Asian Beef with Snow Peas",
        "description": "\"Stir-fried beef in a light gingery sauce. Serve over steamed rice or hot egg noodles.\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/125x70/4538031.jpg"
        ],
        "ingredients": "3 tablespoons soy sauce   2 tablespoons rice wine   1 tablespoon brown sugar   1/2 teaspoon cornstarch   1 tablespoon vegetable oil,1 tablespoon minced fresh ginger root   1 tablespoon minced garlic   1 pound beef round steak, cut into thin strips   8 ounces snow peas   Add all ingredients to list",
        "timetocook": "15 m",
        "instructions": "Prep5 m\n        \n                    \n                Cook10 m\n            \n                    \n                Ready In15 m\n            \n    \n\n\n            \n                        \n                            In a small bowl, combine the soy sauce, rice wine, brown sugar and cornstarch. Set aside.\n                            \n                        \n                        \n                            Heat oil in a wok or skillet over medium high heat. Stir-fry ginger and garlic for 30 seconds. Add the steak and stir-fry for 2 minutes or until evenly browned. Add the snow peas and stir-fry for an additional 3 minutes. Add the soy sauce mixture, bring to a boil, stirring constantly. Lower heat and simmer until the sauce is thick and smooth. Serve immediately.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Asian Fire Meat",
        "Title_link": "https://www.allrecipes.com/recipe/37965/asian-fire-meat/?internalSource=recipe hub&referringId=695&referringContentType=Recipe Hub&clickId=cardslot 35",
        "Headline": "Asian Fire Meat",
        "description": "\"For a great tasting beef dish from Asia, fire meat is delicious and easy to prepare. Ice cold beer is the beverage recommended with fire meat.\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/250x250/819094.jpg",
            "https://images.media-allrecipes.com/userphotos/125x70/819094.jpg"
        ],
        "ingredients": "1/2 cup soy sauce   1 tablespoon sesame oil   2 tablespoons brown sugar   3 cloves garlic, crushed   1 large red onion, chopped   ground black pepper to taste,1 teaspoon red pepper flakes   2 tablespoons sesame seeds   2 leeks, chopped   1 small carrot, chopped   1 pound beef round steak, sliced paper thin   Add all ingredients to list",
        "timetocook": "2 h 20 m",
        "instructions": "Prep15 m\n        \n                    \n                Cook5 m\n            \n                    \n                Ready In2 h 20 m\n            \n    \n\n\n            \n                        \n                            In a large bowl, mix together the soy sauce, sesame oil, brown sugar, garlic, and red onion. Stir in the black pepper, red pepper flakes, sesame seeds, leeks and carrot. Mix in the meat by hand to ensure even coating. Cover and let marinate for at least 2 hours or overnight.\n                            \n                        \n                        \n                            Brush the bottom half of a wok with cooking oil, and heat over medium-high heat. Put in all of the meat and marinade at once, and cook stirring constantly. The meat will be cooked after just a few minutes. Remove from heat and serve with rice or noodles. For Korean-style fire meat, roll the meat mixture up in a leaf of red lettuce.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Beef Egg Rolls",
        "Title_link": "https://www.allrecipes.com/recipe/18252/beef-egg-rolls/?internalSource=recipe hub&referringId=695&referringContentType=Recipe Hub&clickId=cardslot 46",
        "Headline": "Beef Egg Rolls",
        "description": "\"Crispy fried egg rolls stuffed with ground beef, cabbage, and delicious seasonings. A personal creation of mine that goes well with any Chinese dish. The sherry makes it better.\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/250x250/195107.jpg",
            "https://images.media-allrecipes.com/userphotos/125x70/195107.jpg"
        ],
        "ingredients": "1 pound lean ground beef   1 onion, thinly sliced   1/2 teaspoon dried minced garlic   2 tablespoons soy sauce   1/2 teaspoon salt   1/2 teaspoon ground black pepper   2 tablespoons sherry   1 teaspoon ground ginger   1 large head cabbage, finely shredded,1/4 cup water   1 tablespoon vegetable oil   1 teaspoon white sugar   2 tablespoons soy sauce  2 tablespoons sherry  1/2 teaspoon salt  1/2 teaspoon ground black pepper  2 quarts vegetable oil for deep frying   1 (16 ounce) package egg roll wrappers   Add all ingredients to list",
        "timetocook": "45 m",
        "instructions": "Prep25 m\n        \n                    \n                Cook20 m\n            \n                    \n                Ready In45 m\n            \n    \n\n\n            \n                        \n                            In a large skillet over medium-high heat, brown beef, then mix in onion, garlic, 2 tablespoons soy sauce, 1/2 teaspoon salt, 1/2 teaspoon pepper, 2 tablespoons sherry, and ginger. Continue to saute just until onions are tender. Transfer mixture to a bowl and set aside.\n                            \n                        \n                        \n                            In the same skillet, saute cabbage with water, 1 tablespoon oil, sugar, and remaining soy sauce, sherry, salt, and pepper. Continue to saute until cabbage is crisp-tender, about 5 minutes. Return meat mixture to pan and stir together with cabbage over low heat until heated through. Remove from heat.\n                            \n                        \n                        \n                            Pour oil into a deep pan and heat to 350 degrees F (175 degrees C). Fill each egg roll wrapper with approximately 1/4 cup of filling and roll up according to package directions. Fry in preheated oil until golden brown. Drain on paper towels and serve hot.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Beef Lo Mein",
        "Title_link": "https://www.allrecipes.com/recipe/231381/beef-lo-mein/?internalSource=recipe hub&referringId=695&referringContentType=Recipe Hub&clickId=cardslot 61",
        "Headline": "Beef Lo Mein",
        "description": "\"I couldn't find a good lo mein recipe on here, so I'm posting mine. I made it this week and my roommate and I agreed that it was possibly the best that we've ever had.\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/560x315/999688.jpg",
            "https://images.media-allrecipes.com/userphotos/125x70/999688.jpg"
        ],
        "ingredients": "1 (8 ounce) package spaghetti   1 teaspoon dark sesame oil   1 tablespoon peanut oil   4 cloves garlic, minced   1 tablespoon minced fresh ginger root   4 cups mixed vegetables,1 pound flank steak, thinly sliced   3 tablespoons reduced-sodium soy sauce   2 tablespoons brown sugar   1 tablespoon oyster sauce   1 tablespoon Asian chile paste with garlic   Add all ingredients to list",
        "timetocook": "40 m",
        "instructions": "Prep15 m\n        \n                    \n                Cook25 m\n            \n                    \n                Ready In40 m\n            \n    \n\n\n            \n                        \n                            Bring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water until cooked through but firm to the bite, about 12 minutes; drain and transfer to a large bowl. Drizzle sesame oil over the spaghetti; toss to coat. Place a plate atop the bowl to keep the noodles warm.\n                            \n                        \n                        \n                            Heat peanut oil in a wok or large skillet over medium-high heat. Cook and stir garlic and ginger in hot oil until fragrant, about 30 seconds. Add mixed vegetables to the skillet; cook and stir until slightly tender, about 3 minutes. Stir flank steak into the vegetable mixture; cook and stir until the beef is cooked through, about 5 minutes.\n                            \n                        \n                        \n                            Mix soy sauce, brown sugar, oyster sauce, and chile paste together in a small bowl; pour over the spaghetti. Dump spaghetti and sauce mixture into the wok with the vegetables and steak; cook and stir until the spaghetti is hot, 2 to 3 minutes.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Beefy Chinese Dumplings",
        "Title_link": "https://www.allrecipes.com/recipe/87535/beefy-chinese-dumplings/?internalSource=recipe hub&referringId=695&referringContentType=Recipe Hub&clickId=cardslot 89",
        "Headline": "Beefy Chinese Dumplings",
        "description": "\"This is a delicious meat and veggie dumpling recipe that my mom has been making ever since I can remember. It may take some time and practice when it comes to making these, but it's well worth it. Just boil them in water, and serve hot with soy sauce, or add them to a soup.\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/250x250/194673.jpg",
            "https://images.media-allrecipes.com/userphotos/125x70/194673.jpg"
        ],
        "ingredients": "1 1/2 pounds ground beef   2 cups shredded Chinese cabbage   1 carrot, shredded   1 onion, minced   1 egg,1 teaspoon sugar   1 teaspoon salt   1 tablespoon soy sauce   1 tablespoon vegetable oil   1 (14 ounce) package wonton wrappers   Add all ingredients to list",
        "timetocook": "35 m",
        "instructions": "Prep30 m\n        \n                    \n                Cook5 m\n            \n                    \n                Ready In35 m\n            \n    \n\n\n            \n                        \n                            In a large bowl, mix together beef, cabbage, carrot, and onion. Stir in the egg, sugar, salt, soy sauce, and vegetable oil.\n                            \n                        \n                        \n                            Place a large teaspoonful of filling in the center of a dumpling skin. Moisten the edges of a wonton with a few drops of water. Then fold the dumpling in half, and pinch the edges together to seal. Create a ripple pattern along the pinched edge by pinching and gently pushing together small segments of it. Repeat with remaining dumplings.\n                            \n                        \n                        \n                            Boil the dumplings in water until they float to the top, about 5 minutes.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Black Pepper Beef and Cabbage Stir Fry",
        "Title_link": "https://www.allrecipes.com/recipe/50233/black-pepper-beef-and-cabbage-stir-fry/?internalSource=hub recipe&referringId=695&referringContentType=Recipe Hub",
        "Headline": "Black Pepper Beef and Cabbage Stir Fry",
        "description": "\"A very simple Chinese stir-fry dish which is fabulous in taste. I saw my husband going for two additional servings of it and I had to remind him to leave some for the rest of the family! Serve with hot steamed rice.\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/125x70/5181801.jpg"
        ],
        "ingredients": "2 tablespoons vegetable oil   4 cloves garlic, chopped   1/2 pound ground beef   1/2 small head cabbage, shredded   1 red bell pepper, cut into strips,2 tablespoons soy sauce   1 teaspoon cornstarch   1/2 cup cold water   1 teaspoon ground black pepper, or to taste   salt, to taste (optional)   Add all ingredients to list",
        "timetocook": "30 m",
        "instructions": "Prep15 m\n        \n                    \n                Cook15 m\n            \n                    \n                Ready In30 m\n            \n    \n\n\n            \n                        \n                            Heat a wok or large skillet over medium-high heat, and add oil. Saute garlic for about 5 seconds, then add ground beef. Stir-fry until beef is evenly brown, 5 to 7 minutes; drain excess fat.\n                            \n                        \n                        \n                            Stir in cabbage and pepper, and cook until vegetables are tender and beef is fully cooked. Stir in soy sauce. Mix together cornstarch and water, and stir in. Season with pepper; add salt to taste. Cook, stirring, until sauce has thickened.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Chi Tan T'ang (Egg Drop Soup)",
        "Title_link": "https://www.allrecipes.com/recipe/12947/chi-tan-tang-egg-drop-soup/?internalSource=recipe hub&referringId=695&referringContentType=Recipe Hub&clickId=cardslot 53",
        "Headline": "Chi Tan T'ang (Egg Drop Soup)",
        "description": "\"The best egg drop soup I've ever had!!! Reheats well in microwave.\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/250x250/442097.jpg",
            "https://images.media-allrecipes.com/userphotos/125x70/442097.jpg"
        ],
        "ingredients": "8 cubes chicken bouillon   6 cups hot water   2 tablespoons cornstarch   2 tablespoons soy sauce,3 tablespoons distilled white vinegar   1 green onion, minced   3 eggs, beaten   Add all ingredients to list",
        "timetocook": "20 m",
        "instructions": "Prep10 m\n        \n                    \n                Cook10 m\n            \n                    \n                Ready In20 m\n            \n    \n\n\n            \n                        \n                            In a large saucepan, dissolve bouillon in hot water. Mix cornstarch with a small amount of water, and stir into bouillon. Add soy sauce, vinegar, and green onion. Bring to a boil, then simmer, stirring occasionally. Gradually pour the beaten eggs into the saucepan while stirring. Serve at once.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Chinese Cabbage Salad II",
        "Title_link": "https://www.allrecipes.com/recipe/14447/chinese-cabbage-salad-ii/?internalSource=recipe hub&referringId=695&referringContentType=Recipe Hub&clickId=cardslot 81",
        "Headline": "Chinese Cabbage Salad II",
        "description": "\"This is a wonderful and crunchy cabbage salad with great texture and color.  You can vary the flavor a little by using beef flavored ramen, if you like.\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/560x315/3094395.jpg",
            "https://images.media-allrecipes.com/userphotos/125x70/1436285.jpg"
        ],
        "ingredients": "3 tablespoons red wine vinegar   2 tablespoons white sugar   1/2 teaspoon salt   1/4 teaspoon ground black pepper   1 (3 ounce) package chicken flavored ramen noodles, crushed, seasoning packet reserved,1/2 cup vegetable oil   1 (16 ounce) package broccoli coleslaw mix   1/2 cup chopped green onions   4 ounces toasted slivered almonds   1/4 cup sesame seeds, toasted   Add all ingredients to list",
        "timetocook": "45 m",
        "instructions": "Prep15 m\n        \n                    \n                Cook10 m\n            \n                    \n                Ready In45 m\n            \n    \n\n\n            \n                        \n                            In a small saucepan, cook the vinegar and sugar over medium heat until dissolved. Remove from heat and stir in salt, pepper, ramen seasoning packet and oil. Set aside to cool.\n                            \n                        \n                        \n                            In a large bowl, combine the uncooked ramen noodles, broccoli coleslaw mix, and green onions. Pour dressing over salad; toss evenly to coat. Refrigerate until chilled.\n                            \n                        \n                        \n                            Sprinkle with almonds and sesame seeds before serving.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Chinese Fried Noodles",
        "Title_link": "https://www.allrecipes.com/recipe/34668/chinese-fried-noodles/?internalSource=recipe hub&referringId=695&referringContentType=Recipe Hub&clickId=cardslot 42",
        "Headline": "Chinese Fried Noodles",
        "description": "\"This is a quick, easy, and delicious recipe that all will enjoy. Try adding cooked, cubed pork or chicken, bean sprouts, water chestnuts, sliced almonds, or any of your favorite vegetables for versatility.\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/125x70/1067424.jpg"
        ],
        "ingredients": "2 (3 ounce) packages Oriental flavored ramen noodles   3 eggs, beaten   vegetable oil   4 green onions, thinly sliced   1 small carrot, peeled and grated,1/2 cup green peas   1/4 cup red bell pepper, minced   2 tablespoons sesame oil   soy sauce   Add all ingredients to list",
        "timetocook": "40 m",
        "instructions": "Prep15 m\n        \n                    \n                Cook25 m\n            \n                    \n                Ready In40 m\n            \n    \n\n\n            \n                        \n                            Boil ramen noodles for 3 minutes, or until softened, without flavor packets. Reserve flavor packets. Drain noodles, and set aside.\n                            \n                        \n                        \n                            Heat 1 tablespoon oil in a small skillet. Scramble eggs in a bowl. Cook and stir in hot oil until firm. Set aside.\n                            \n                        \n                        \n                            In a separate skillet, heat 1 teaspoon of oil over medium heat. Cook and stir green onions in oil for 2 to 3 minutes, or until softened. Transfer to a separate dish, and set aside. Heat another teaspoon of cooking oil in the same skillet. Cook and stir the the carrots, peas, and bell peppers separately in the same manner, setting each aside when done.\n                            \n                        \n                        \n                            Combine 2 tablespoons sesame oil with 1 tablespoon of vegetable oil in a separate skillet or wok. Fry noodles in oil for 3 to 5 minutes over medium heat, turning regularly. Sprinkle soy sauce, sesame oil, and desired amount of reserved ramen seasoning packets over noodles, and toss to coat. Add vegetables, and continue cooking, turning frequently, for another 5 minutes.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Chinese Green Bean Stir-Fry",
        "Title_link": "https://www.allrecipes.com/recipe/49350/chinese-green-bean-stir-fry/?internalSource=staff pick&referringId=695&referringContentType=Recipe Hub",
        "Headline": "Chinese Green Bean Stir-Fry",
        "description": "\"Asian-style green beans with lots of flavor! This recipe is made for a large party; but can be scaled down for a family dinner.  Serve cold or warm.\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/560x315/266714.jpg",
            "https://images.media-allrecipes.com/userphotos/125x70/266714.jpg"
        ],
        "ingredients": "1 cup vegetable oil   13 pounds fresh green beans, trimmed   5 tablespoons minced garlic   5 tablespoons minced fresh ginger root,2 tablespoons kosher salt   1 tablespoon coarsely ground black pepper   2 (8 ounce) bottles black bean sauce   Add all ingredients to list",
        "timetocook": "35 m",
        "instructions": "Prep20 m\n        \n                    \n                Cook15 m\n            \n                    \n                Ready In35 m\n            \n    \n\n\n            \n                        \n                            In a large wok, heat oil over medium-high heat. Stir in green beans; cook, stirring frequently, for 1 to 2 minutes. Stir in garlic and ginger; cook, stirring frequently, for 3 to 4 minutes. Season with salt and pepper, and then stir in black bean sauce. Continue cooking until green beans are tender.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Chinese Green Bean Stir-Fry",
        "Title_link": "https://www.allrecipes.com/recipe/49350/chinese-green-bean-stir-fry/?internalSource=recipe hub&referringId=695&referringContentType=Recipe Hub&clickId=cardslot 90",
        "Headline": "Chinese Green Bean Stir-Fry",
        "description": "\"Asian-style green beans with lots of flavor! This recipe is made for a large party; but can be scaled down for a family dinner.  Serve cold or warm.\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/560x315/266714.jpg",
            "https://images.media-allrecipes.com/userphotos/125x70/266714.jpg"
        ],
        "ingredients": "1 cup vegetable oil   13 pounds fresh green beans, trimmed   5 tablespoons minced garlic   5 tablespoons minced fresh ginger root,2 tablespoons kosher salt   1 tablespoon coarsely ground black pepper   2 (8 ounce) bottles black bean sauce   Add all ingredients to list",
        "timetocook": "35 m",
        "instructions": "Prep20 m\n        \n                    \n                Cook15 m\n            \n                    \n                Ready In35 m\n            \n    \n\n\n            \n                        \n                            In a large wok, heat oil over medium-high heat. Stir in green beans; cook, stirring frequently, for 1 to 2 minutes. Stir in garlic and ginger; cook, stirring frequently, for 3 to 4 minutes. Season with salt and pepper, and then stir in black bean sauce. Continue cooking until green beans are tender.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Chinese Pepper Steak",
        "Title_link": "https://www.allrecipes.com/recipe/172704/chinese-pepper-steak/?internalSource=hub recipe&referringId=695&referringContentType=Recipe Hub",
        "Headline": "Chinese Pepper Steak",
        "description": "\"A delicious meal, served with boiled white rice, that's easy and made from items that I've already got in my cupboards! My mother clipped this recipe from somewhere and it became a specialty of mine; however, I've been unable to find the original source.\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/125x70/7127114.jpg"
        ],
        "ingredients": "1 pound beef top sirloin steak   1/4 cup soy sauce   2 tablespoons white sugar   2 tablespoons cornstarch   1/2 teaspoon ground ginger,3 tablespoons vegetable oil, divided   1 red onion, cut into 1-inch squares   1 green bell pepper, cut into 1-inch squares   2 tomatoes, cut into wedges   Add all ingredients to list",
        "timetocook": "30 m",
        "instructions": "Prep15 m\n        \n                    \n                Cook15 m\n            \n                    \n                Ready In30 m\n            \n    \n\n\n            \n                        \n                            Slice the steak into 1/2-inch thick slices across the grain.\n                            \n                        \n                        \n                            Whisk together soy sauce, sugar, cornstarch, and ginger in a bowl until the sugar has dissolved and the mixture is smooth. Place the steak slices into the marinade, and stir until well-coated.\n                            \n                        \n                        \n                            Heat 1 tablespoon of vegetable oil in a wok or large skillet over medium-high heat, and place 1/3 of the steak strips into the hot oil. Cook and stir until the beef is well-browned, about 3 minutes, and remove the beef from the wok to a bowl. Repeat twice more, with the remaining beef, and set the cooked beef aside.\n                            \n                        \n                        \n                            Return all the cooked beef to the hot wok, and stir in the onion. Toss the beef and onion together until the onion begins to soften, about 2 minutes, then stir in the green pepper. Cook and stir the mixture until the pepper has turned bright green and started to become tender, about 2 minutes, then add the tomatoes, stir everything together, and serve.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Chinese Steamed Buns",
        "Title_link": "https://www.allrecipes.com/recipe/7011/chinese-steamed-buns/?internalSource=recipe hub&referringId=695&referringContentType=Recipe Hub&clickId=cardslot 45",
        "Headline": "Chinese Steamed Buns",
        "description": "\"Here's some yummy, Chinese dim sum you can make, either plain without meat fillings, or with meat fillings. A wok equipped with a stainless steel steam plate, a plate with holes to allow steam to pass, is required to make these tasty buns. You may use milk in place of the warm water if you wish.\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/560x315/1121464.jpg",
            "https://images.media-allrecipes.com/userphotos/125x70/1121464.jpg"
        ],
        "ingredients": "1 tablespoon active dry yeast   1 teaspoon white sugar   1/4 cup all-purpose flour   1/4 cup water   1/2 cup warm water,1 1/2 cups all-purpose flour  1/4 teaspoon salt   2 tablespoons white sugar  1 tablespoon vegetable oil   1/2 teaspoon baking powder   Add all ingredients to list",
        "timetocook": "4 h",
        "instructions": "Prep30 m\n        \n                    \n                Cook30 m\n            \n                    \n                Ready In4 h\n            \n    \n\n\n            \n                        \n                            Mix together yeast, 1 teaspoon sugar, 1/4 cup flour, and 1/4 cup warm water.  Allow to stand for 30 minutes.\n                            \n                        \n                        \n                            Mix in 1/2 cup warm water, flour, salt, 2 tablespoons sugar, and vegetable oil.  Knead until dough surface is smooth and elastic.  Roll over in a greased bowl, and let stand until triple in size, about 2 1/2 to 3 hours.\n                            \n                        \n                        \n                            Punch down dough, and spread out on a floured board.  Sprinkle baking powder evenly on surface, and knead for 5 minutes.  Divide dough into 2 parts, and place the piece you are not working with in a covered bowl.  Divide each half into 12 parts. Shape each part into a ball with smooth surface up. Put each ball on a wax paper square.   Let stand covered until double, about 30 minutes.\n                            \n                        \n                        \n                            Bring water to a boil in wok, and reduce heat to medium; the water should still be boiling.  Place steam-plate on a small wire rack in the middle of the wok. Transfer as many buns on wax paper as will comfortably fit onto steam-plate leaving 1 to 2 inches between the buns.  At least 2 inches space should be left between steam-plate and the wok.  Cover wok with lid.  Steam buns over boiling water for 15 minutes.\n                            \n                        \n                        \n                            REMOVE LID BEFORE you turn off heat, or else water will drip back onto bun surface and produce yellowish \"blisters\" on bun surfaces. Continue steaming batches of buns until all are cooked.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Chinese Style Sesame Sauce",
        "Title_link": "https://www.allrecipes.com/recipe/46908/chinese-style-sesame-sauce/?internalSource=recipe hub&referringId=695&referringContentType=Recipe Hub&clickId=cardslot 59",
        "Headline": "Chinese Style Sesame Sauce",
        "description": "\"This is the SAUCE for Chinese restaurant style sesame chicken and broccoli. This sauce can be poured over fried chicken, or used as a dipping sauce for fried chicken. I emphasize not using too much vinegar because it turns into a sweet-n-sour type sauce. But you do need a 'touch' of vinegar.\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/560x315/5287329.jpg",
            "https://images.media-allrecipes.com/userphotos/125x70/5287329.jpg"
        ],
        "ingredients": "1 cup white sugar   1/4 cup cornstarch   1 cup chicken broth   1/2 cup water   1/8 cup white vinegar,2 tablespoons dark soy sauce   2 tablespoons sesame oil   1 teaspoon chile paste   1 clove garlic, minced   Add all ingredients to list",
        "timetocook": "20 m",
        "instructions": "Prep10 m\n        \n                    \n                Cook10 m\n            \n                    \n                Ready In20 m\n            \n    \n\n\n            \n                        \n                            In a saucepan, mix together sugar and cornstarch. Stir in chicken broth, water, vinegar, soy sauce, sesame oil, chile paste, and garlic. Bring to a boil over medium heat, stirring constantly. Reduce heat, and simmer 5 minutes.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Chinese-Style Baby Bok Choy with Mushroom Sauce",
        "Title_link": "https://www.allrecipes.com/recipe/215795/chinese-style-baby-bok-choy-with-mushroom-sauce/?internalSource=recipe hub&referringId=695&referringContentType=Recipe Hub&clickId=cardslot 67",
        "Headline": "Chinese-Style Baby Bok Choy with Mushroom Sauce",
        "description": "\"This is a delicious dish. It is an authentic Chinese recipe that I use for my cooking. Baby bok choy and mushroom are the two main ingredients. \"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/560x315/609337.jpg",
            "https://images.media-allrecipes.com/userphotos/125x70/609337.jpg"
        ],
        "ingredients": "2 tablespoons oyster sauce   1 tablespoon soy sauce   2 teaspoons brown sugar   1 teaspoon potato starch   1 tablespoon water   2 pinches salt,1/4 teaspoon vegetable oil   4 heads baby bok choy   3 tablespoons olive oil   2 tablespoons minced green onion   1 tablespoon minced garlic   1 (8 ounce) package sliced portobello mushrooms   Add all ingredients to list",
        "timetocook": "35 m",
        "instructions": "Prep20 m\n        \n                    \n                Cook15 m\n            \n                    \n                Ready In35 m\n            \n    \n\n\n            \n                        \n                            In a bowl, mix together the oyster sauce, soy sauce, and brown sugar until the sugar has dissolved. Mix the potato starch and water in a small bowl, and stir it into the oyster sauce mixture until smooth.\n                            \n                        \n                        \n                            Fill a pot with water, bring to a boil, and stir in salt and vegetable oil. Place the bok choy into the boiling water, and cook until tender, shiny, and bright green, 2 to 3 minutes. Drain the bok choy, and arrange attractively on a serving platter.\n                            \n                        \n                        \n                            Heat the olive oil in a large skillet or wok until the oil shimmers, then toss the green onion and garlic in the hot oil until fragrant, about 20 seconds; stir in the mushrooms. Cook and stir until the mushrooms begin to shrink slightly. Sprinkle the mushrooms lightly with salt. Continue to cook the mushrooms, stirring often, until they are tender, about 5 minutes. Pour in the oyster sauce mixture, then stir until the sauce is thickened and coats the mushrooms, 30 seconds to 1 minute. Pour the thickened mushroom sauce over the bok choy; serve immediately.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Crab Rangoon I",
        "Title_link": "https://www.allrecipes.com/recipe/14850/crab-rangoon-i/?internalSource=recipe hub&referringId=695&referringContentType=Recipe Hub&clickId=cardslot 60",
        "Headline": "Crab Rangoon I",
        "description": "\"Everyone will love these bite-size, fried dumplings stuffed with crab. You can make these in advance of the festivities, and freeze on trays until party time.\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/560x315/1482086.jpg",
            "https://images.media-allrecipes.com/userphotos/125x70/1482086.jpg"
        ],
        "ingredients": "1 (14 ounce) package small won ton wrappers   2 (8 ounce) packages cream cheese, softened   1 teaspoon minced fresh ginger root   1/2 teaspoon chopped fresh cilantro,1/2 teaspoon dried parsley   3 tablespoons dark soy sauce   1 pound crabmeat, shredded   1 quart oil for frying   Add all ingredients to list",
        "timetocook": "30 m",
        "instructions": "Prep20 m\n        \n                    \n                Cook10 m\n            \n                    \n                Ready In30 m\n            \n    \n\n\n            \n                        \n                            Heat oil in a large heavy skillet or deep fryer to 360 degrees F (180 degrees C).\n                            \n                        \n                        \n                            In a small bowl, mix together cream cheese, soy sauce, ginger, garlic, parsley, cilantro and crabmeat.\n                            \n                        \n                        \n                            Place 1/2 to 1 teaspoon of the cream cheese mixture into the center of each wonton wrapper. Fold the won ton wrapper over the stuffing to make a triangle or a half moon, depending on the shape of the won ton wrappers you have purchased. Moisten the edges with a little water, and seal.  Place prepared won tons under a slightly moist paper towel until ready for frying.\n                            \n                        \n                        \n                            Add 3 or 4 wontons to the hot oil, and cook until golden brown, turning once. Set aside on paper towels to drain. Repeat until all wontons have been fried.  Serve hot.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Crispy Ginger Beef",
        "Title_link": "https://www.allrecipes.com/recipe/237807/crispy-ginger-beef/?internalSource=recipe hub&referringId=695&referringContentType=Recipe Hub&clickId=cardslot 73",
        "Headline": "Crispy Ginger Beef",
        "description": "\"This recipe is so much better than take out! Serve it with homemade fried rice or plain rice. If you like spicy, just add more chili pepper flakes!\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/560x315/5307100.jpg",
            "https://images.media-allrecipes.com/userphotos/125x70/5307100.jpg"
        ],
        "ingredients": "3/4 cup cornstarch   1/2 cup water   2 eggs   1 pound flank steak, cut into thin strips   1/2 cup canola oil, or as needed   1 large carrot, cut into matchstick-size pieces   1 green bell pepper, cut into matchstick-size pieces   1 red bell pepper, cut into matchstick-size pieces,3 green onions, chopped   1/4 cup minced fresh ginger root   5 garlic cloves, minced   1/2 cup white sugar   1/4 cup rice vinegar   3 tablespoons soy sauce   1 tablespoon sesame oil   1 tablespoon red pepper flakes, or to taste   Add all ingredients to list",
        "timetocook": "45 m",
        "instructions": "Prep25 m\n        \n                    \n                Cook20 m\n            \n                    \n                Ready In45 m\n            \n    \n\n\n            \n                        \n                            Place cornstarch in a large bowl; gradually whisk in water until smooth. Whisk eggs into cornstarch mixture; toss steak strips in mixture to coat.\n                            \n                        \n                        \n                            Pour canola oil into wok 1-inch deep; heat oil over high heat until hot but not smoking. Place 1/4 of the beef strips into hot oil; separate strips with a fork. Cook, stirring frequently, until coating is crisp and golden, about 3 minutes. Remove beef to drain on paper towels; repeat with remaining beef.\n                            \n                        \n                        \n                            Drain off all but 1 tablespoon oil; cook and stir carrot, green bell pepper, red bell pepper, green onions, ginger, and garlic over high heat until lightly browned but still crisp, about 3 minutes.\n                            \n                        \n                        \n                            Whisk sugar, rice vinegar, soy sauce, sesame oil, and red pepper together in a small bowl. Pour sauce mixture over vegetables in wok; bring mixture to a boil. Stir beef back into vegetable mixture; cook and stir just until heated through, about 3 minutes.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Crispy Orange Beef",
        "Title_link": "https://www.allrecipes.com/recipe/57966/crispy-orange-beef/?internalSource=hub recipe&referringId=695&referringContentType=Recipe Hub",
        "Headline": "Crispy Orange Beef",
        "description": "\"A delicious crispy and sweet, yet mildly spiced beef stir-fry recipe. Great served with steamed rice and broccoli.\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/560x315/1028228.jpg",
            "https://images.media-allrecipes.com/userphotos/125x70/1028228.jpg"
        ],
        "ingredients": "1 1/2 pounds beef top sirloin, thinly sliced   1/3 cup white sugar   1/3 cup rice wine vinegar   2 tablespoons frozen orange juice concentrate   1 teaspoon salt   1 tablespoon soy sauce   1 cup long grain rice,2 cups water   1/4 cup cornstarch   2 teaspoons orange zest   3 tablespoons grated fresh ginger   1 1/2 tablespoons minced garlic   8 broccoli florets, lightly steamed or blanched   2 cups oil for frying   Add all ingredients to list",
        "timetocook": "1 h 5 m",
        "instructions": "Prep20 m\n        \n                    \n                Cook15 m\n            \n                    \n                Ready In1 h 5 m\n            \n    \n\n\n            \n                        \n                            Lay beef strips out in a single layer on a baking sheet lined with paper towels. Allow to dry in the refrigerator for 30 minutes. In a small bowl, mix together the sugar, rice vinegar, orange juice concentrate, salt and soy sauce. Set aside.\n                            \n                        \n                        \n                            Meanwhile, combine rice and water in a medium saucepan. Bring to a boil, then reduce heat to medium-low and simmer for 20 minutes, or until rice is tender. Add more water at the end if necessary.\n                            \n                        \n                        \n                            Heat oil in a wok over medium-high heat. Toss dried beef in cornstarch to coat. Fry in the hot oil in small batches until crispy and golden brown; set aside. Drain all of the oil from the wok except about 1 tablespoon.\n                            \n                        \n                        \n                            Add orange zest, ginger and garlic to the remaining oil, and cook briefly until fragrant. Add the soy sauce mixture to the wok, bring to a boil, and cook until thick and syrupy, about 5 minutes. Add beef, and heat through, stirring to coat. Serve immediately over steamed rice, and garnish with broccoli.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Easy Chinese Corn Soup",
        "Title_link": "https://www.allrecipes.com/recipe/29704/easy-chinese-corn-soup/?internalSource=recipe hub&referringId=695&referringContentType=Recipe Hub&clickId=cardslot 86",
        "Headline": "Easy Chinese Corn Soup",
        "description": "\"This quick and easy soup is so good that I never bother ordering it from Chinese restaurants anymore!\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/560x315/587930.jpg",
            "https://images.media-allrecipes.com/userphotos/125x70/587930.jpg"
        ],
        "ingredients": "1 (15 ounce) can cream style corn   1 (14.5 ounce) can low-sodium chicken broth   1 egg, beaten,1 tablespoon cornstarch   2 tablespoons water   Add all ingredients to list",
        "timetocook": "15 m",
        "instructions": "Prep5 m\n        \n                    \n                Cook10 m\n            \n                    \n                Ready In15 m\n            \n    \n\n\n            \n                        \n                            In a saucepan, combine the cream style corn and chicken broth. Bring to a boil over medium-high heat. In a small bowl or cup, mix together the cornstarch and water; pour into the boiling corn soup, and continue cooking for about 2 minutes, or until thickened. Gradually add the beaten egg while stirring the soup. Remove from heat and serve.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Egg Drop Soup (Better than Restaurant Quality!)",
        "Title_link": "https://www.allrecipes.com/recipe/115965/egg-drop-soup-better-than-restaurant-quality/?internalSource=hub recipe&referringId=695&referringContentType=Recipe Hub",
        "Headline": "Egg Drop Soup (Better than Restaurant Quality!)",
        "description": "\"After many many trips to different Chinese restaurants looking for a good bowl of egg drop soup, I decided to take it upon myself to create what I feel is the ultimate in egg drop soup. I hope you enjoy it as much as I do!\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/125x70/972459.jpg"
        ],
        "ingredients": "1 cup chicken broth   1/4 teaspoon soy sauce   1/4 teaspoon sesame oil   1 teaspoon cornstarch (optional)   2 teaspoons water (optional),1 egg, beaten   1 drop yellow food coloring (optional)   1 teaspoon chopped fresh chives   1/8 teaspoon salt (optional)   1/2 teaspoon ground white pepper (optional)   Add all ingredients to list",
        "timetocook": "10 m",
        "instructions": "Prep5 m\n        \n                    \n                Cook5 m\n            \n                    \n                Ready In10 m\n            \n    \n\n\n            \n                        \n                            In a small saucepan, combine the chicken broth, soy sauce and sesame oil. Bring to a boil. Stir together the cornstarch and water to dissolve cornstarch; pour into the boiling broth. Stir gently while you pour in the egg and yellow food coloring if using. Season with chives, salt and pepper before serving.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Egg Drop Soup I",
        "Title_link": "https://www.allrecipes.com/recipe/13207/egg-drop-soup-i/?internalSource=recipe hub&referringId=695&referringContentType=Recipe Hub&clickId=cardslot 58",
        "Headline": "Egg Drop Soup I",
        "description": "\"A family favorite when we're sick.  Garnish with parsley flakes and serve with soy sauce.  Better than chicken soup!\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/250x250/143626.jpg",
            "https://images.media-allrecipes.com/userphotos/125x70/143626.jpg"
        ],
        "ingredients": "4 cups water   4 cubes chicken bouillon   2 eggs,1 teaspoon dried parsley   1 tablespoon dried minced onion   1 tablespoon cornstarch   Add all ingredients to list",
        "timetocook": "20m",
        "instructions": "In a medium saucepan, combine water, bouillon, and parsley and onion flakes.  Bring to a boil.\n                            \n                        \n                        \n                            Lightly beat eggs together. Gradually stir into soup.\n                            \n                        \n                        \n                            Remove about half a cup of the soup.  Stir in cornstarch until there are no lumps, and return to the soup.  Boil until soup thickens.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Egg Drop Soup II",
        "Title_link": "https://www.allrecipes.com/recipe/13343/egg-drop-soup-ii/?internalSource=recipe hub&referringId=695&referringContentType=Recipe Hub&clickId=cardslot 39",
        "Headline": "Egg Drop Soup II",
        "description": "\"This is a quick and easy recipe that tastes really good.  To add a little more to this soup add one small (7 to 8 ounce) can creamed corn and omit the egg.\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/560x315/2918090.jpg",
            "https://images.media-allrecipes.com/userphotos/125x70/2918090.jpg"
        ],
        "ingredients": "2 (14.5 ounce) cans chicken broth   1 tablespoon cornstarch,1 egg, lightly beaten   2 tablespoons chopped green onion   Add all ingredients to list",
        "timetocook": "20m",
        "instructions": "In a medium stock pot, mix cold chicken broth with cornstarch. Slowly heat over medium heat, stirring frequently.\n                            \n                        \n                        \n                            Pour beaten egg into soup, and stir once around stock pot very gently, in order to break up egg. Remove soup from heat immediately, divide into four portions and garnish with green onions.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Eggplant with Garlic Sauce",
        "Title_link": "https://www.allrecipes.com/recipe/201964/eggplant-with-garlic-sauce/?internalSource=recipe hub&referringId=695&referringContentType=Recipe Hub&clickId=cardslot 38",
        "Headline": "Eggplant with Garlic Sauce",
        "description": "\"A mildly spicy (or very spicy if you like) eggplant dish. My mother has been making this for me since I was a child. It is SO GOOD!!\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/560x315/416924.jpg",
            "https://images.media-allrecipes.com/userphotos/125x70/416924.jpg"
        ],
        "ingredients": "3 tablespoons canola oil   4 Chinese eggplants, halved lengthwise and cut into 1 inch half moons   1 cup water   1 tablespoon crushed red pepper flakes   3 tablespoons garlic powder,5 teaspoons white sugar   1 teaspoon cornstarch   2 tablespoons light soy sauce   2 tablespoons oyster sauce   Add all ingredients to list",
        "timetocook": "25 m",
        "instructions": "Prep10 m\n        \n                    \n                Cook15 m\n            \n                    \n                Ready In25 m\n            \n    \n\n\n            \n                        \n                            Heat the canola oil in a skillet over high heat. Cook and stir the eggplant until soft, about 4 minutes. Stir in the water, red pepper flakes, and garlic powder. Cover and simmer until all the water is absorbed. Meanwhile, mix sugar, cornstarch, soy sauce, and oyster sauce in a bowl until sugar and cornstarch have dissolved. Stir sauce into the eggplant, making sure to evenly coat the eggplant. Cook until the sauce has thickened.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Flavorful Beef Stir-Fry",
        "Title_link": "https://www.allrecipes.com/recipe/223389/flavorful-beef-stir-fry/?internalSource=recipe hub&referringId=695&referringContentType=Recipe Hub&clickId=cardslot 64",
        "Headline": "Flavorful Beef Stir-Fry",
        "description": "\"A beef stir-fry that has wonderful flavors without using a ton of spices. Fresh ginger mixes will with the soy sauce and makes a quick and easy sauce. Lots of veggies add color and crunch.\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/560x315/3759728.jpg",
            "https://images.media-allrecipes.com/userphotos/125x70/3759728.jpg"
        ],
        "ingredients": "2 cups brown rice   4 cups water   2 tablespoons cornstarch   2 teaspoons white sugar   6 tablespoons soy sauce   1/4 cup white wine   1 tablespoon minced fresh ginger   1 pound boneless beef round steak, cut into thin strips   1 tablespoon vegetable oil,3 cups broccoli florets   2 carrots, thinly sliced   1 (6 ounce) package frozen pea pods, thawed   2 tablespoons chopped onion   1 (8 ounce) can sliced water chestnuts, undrained   1 cup Chinese cabbage   2 large heads bok choy, chopped   1 tablespoon vegetable oil  Add all ingredients to list",
        "timetocook": "1 h 10 m",
        "instructions": "Prep10 m\n        \n                    \n                Cook1 h\n            \n                    \n                Ready In1 h 10 m\n            \n    \n\n\n            \n                        \n                            Bring brown rice and water to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until rice is tender, and liquid has been absorbed, 45 to 50 minutes.\n                            \n                        \n                        \n                            Combine cornstarch, sugar, soy sauce, and wine in a small bowl until smooth. Stir in ginger; toss beef in sauce to coat.\n                            \n                        \n                        \n                            Heat 1 tablespoon oil in a large skillet over medium-high heat. Cook and stir broccoli, carrots, pea pods, and onion for 1 minute. Stir in water chestnuts, Chinese cabbage, and bok choy; cover and simmer until vegetables are tender, about 4 minutes. Remove from skillet and keep warm.\n                            \n                        \n                        \n                            In same skillet, heat 1 tablespoon oil over medium-high heat. Cook and stir beef until desired degree of doneness, about 2 minutes per side for medium. Return vegetables to skillet; cook and stir until heated through, about 3 minutes. Serve over rice.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Honey Walnut Shrimp",
        "Title_link": "https://www.allrecipes.com/recipe/93234/honey-walnut-shrimp/?internalSource=staff pick&referringId=695&referringContentType=Recipe Hub",
        "Headline": "Honey Walnut Shrimp",
        "description": "\"Hong Kong Style Chinese recipe! Crispy battered shrimp tossed in creamy sauce topped with sugar coated walnuts\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/125x70/270515.jpg"
        ],
        "ingredients": "1 cup water   2/3 cup white sugar   1/2 cup walnuts   4 egg whites   2/3 cup mochiko (glutinous rice flour),1/4 cup mayonnaise   1 pound large shrimp, peeled and deveined   2 tablespoons honey   1 tablespoon canned sweetened condensed milk   1 cup vegetable oil for frying   Add all ingredients to list",
        "timetocook": "30 m",
        "instructions": "Prep15 m\n        \n                    \n                Cook15 m\n            \n                    \n                Ready In30 m\n            \n    \n\n\n            \n                        \n                            Stir together the water and sugar in a small saucepan. Bring to a boil and add the walnuts. Boil for 2 minutes, then drain and place walnuts on a cookie sheet to dry.\n                            \n                        \n                        \n                            Whip egg whites in a medium bowl until foamy. Stir in the mochiko until it has a pasty consistency. Heat the oil in a heavy deep skillet over medium-high heat. Dip shrimp into the mochiko batter, and then fry in the hot oil until golden brown, about 5 minutes. Remove with a slotted spoon and drain on paper towels.\n                            \n                        \n                        \n                            In a medium serving bowl, stir together the mayonnaise, honey and sweetened condensed milk. Add shrimp and toss to coat with the sauce. Sprinkle the candied walnuts on top and serve.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Hot and Sour Chinese Eggplant",
        "Title_link": "https://www.allrecipes.com/recipe/52925/hot-and-sour-chinese-eggplant/?internalSource=recipe hub&referringId=695&referringContentType=Recipe Hub&clickId=cardslot 30",
        "Headline": "Hot and Sour Chinese Eggplant",
        "description": "\"Eggplant is sauteed, then coated in a spicy sweet sauce. It is simple and delicious! I'm sure you'll enjoy this!\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/560x315/3314667.jpg",
            "https://images.media-allrecipes.com/userphotos/125x70/3314667.jpg"
        ],
        "ingredients": "2 long Chinese eggplants, cubed   1 1/2 tablespoons soy sauce   1 tablespoon red wine vinegar   1 tablespoon white sugar   1 green chile pepper, chopped,1 teaspoon cornstarch   1/2 teaspoon chili oil, or to taste   2 teaspoons salt   2 tablespoons vegetable oil   Add all ingredients to list",
        "timetocook": "35 m",
        "instructions": "Prep30 m\n        \n                    \n                Cook5 m\n            \n                    \n                Ready In35 m\n            \n    \n\n\n            \n                        \n                            Place the eggplant cubes into a large bowl, and sprinkle with salt. Fill with enough water to cover, and let stand for 30 minutes. Rinse well, and drain on paper towels.\n                            \n                        \n                        \n                            In a small bowl, stir together the soy sauce, red wine vinegar, sugar, chile pepper, cornstarch and chili oil. Set the sauce aside.\n                            \n                        \n                        \n                            Heat the vegetable oil in a large skillet or wok over medium-high heat. Fry the eggplant until it is tender and begins to brown, 5 to 10 minutes. Pour in the sauce, and cook and stir until the sauce is thick and the eggplant is evenly coated. Serve immediately.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Hot and Tangy Broccoli Beef",
        "Title_link": "https://www.allrecipes.com/recipe/86410/hot-and-tangy-broccoli-beef/?internalSource=recipe hub&referringId=695&referringContentType=Recipe Hub&clickId=cardslot 61",
        "Headline": "Hot and Tangy Broccoli Beef",
        "description": "\"Tangy and spicy beef and broccoli are a winning combination in this quick stir-fry dinner.\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/560x315/5181687.jpg",
            "https://images.media-allrecipes.com/userphotos/125x70/5181687.jpg"
        ],
        "ingredients": "3/4 pound boneless tender beef steak, rib eye, sirloin or flank   1 tablespoon cornstarch   3 tablespoons Kikkoman Soy Sauce, divided   1 large clove garlic, minced   1/2 teaspoon sugar   1 pound fresh broccoli, trimmed,4 teaspoons cornstarch  1/2 teaspoon crushed red pepper   3 tablespoons vegetable oil, divided   1 medium onion, thinly sliced   2 teaspoons Kikkoman Seasoned Rice Vinegar   Add all ingredients to list",
        "timetocook": "35m",
        "instructions": "Cut beef across grain into thin slices. Combine 1 Tbsp. each cornstarch and soy sauce with garlic and sugar in medium bowl; stir in beef. Let stand 10 minutes.\n                            \n                        \n                        \n                            Meanwhile, remove flowerets from broccoli; cut into bite-size pieces. Peel stalks; cut diagonally into thin slices.\n                            \n                        \n                        \n                            Combine 1 cup water, remaining 2 Tbsp. soy sauce, 4 teaspoons cornstarch and crushed red pepper in small bowl. Set aside.\n                            \n                        \n                        \n                            Heat 1 Tbsp. oil in hot wok or large skillet over high heat. Add beef and stir-fry 1 minute; remove.\n                            \n                        \n                        \n                            Heat remaining 2 Tbsp. oil in same pan. Add broccoli and onion; stir-fry 2 minutes. Sprinkle 1 Tbsp. water over vegetables; cover and cook 2 minutes, stirring occasionally.\n                            \n                        \n                        \n                            Add beef and soy sauce mixture; cook and stir until sauce boils and thickens. Remove from heat; stir in vinegar.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Kikkoman Chinese Pepper Steak",
        "Title_link": "https://www.allrecipes.com/recipe/86407/kikkoman-chinese-pepper-steak/?internalSource=recipe hub&referringId=695&referringContentType=Recipe Hub&clickId=cardslot 93",
        "Headline": "Kikkoman Chinese Pepper Steak",
        "description": "\"Beef strips are stir-fried with onion and peppers in this quick stove-top meal. Serve with your favorite rice or noodles.\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/560x315/6293324.jpg",
            "https://images.media-allrecipes.com/userphotos/125x70/6293324.jpg"
        ],
        "ingredients": "1 pound boneless beef sirloin or round steak   1 tablespoon Kikkoman Hoisin Sauce   2 tablespoons vegetable oil, divided,2 medium bell peppers, cut into 1-inch squares   2 medium onions, cut into 1-inch squares   1/4 cup Kikkoman Hoisin Sauce  Add all ingredients to list",
        "timetocook": "35m",
        "instructions": "Cut steak across grain into thin strips, then into 1-inch squares; coat with 1 Tbsp. hoisin sauce.\r\n                            \r\n                        \r\n                        \r\n                            Heat 1 Tbsp. oil in hot wok or large skillet over high heat. Add beef and stir-fry about 1 minute; remove.\r\n                            \r\n                        \r\n                        \r\n                            Heat remaining 1 Tbsp. oil in same pan. Add peppers and onions; stir-fry 5 minutes. Stir in beef and remaining 1/4 cup hoisin sauce; cook and stir just until beef and vegetables are coated with sauce. Serve immediately.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Mongolian Beef and Spring Onions",
        "Title_link": "https://www.allrecipes.com/recipe/201849/mongolian-beef-and-spring-onions/?internalSource=hub recipe&referringId=695&referringContentType=Recipe Hub",
        "Headline": "Mongolian Beef and Spring Onions",
        "description": "\"A soy-based Chinese-style beef dish. Best served over soft rice noodles or rice.\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/125x70/7317087.jpg"
        ],
        "ingredients": "2 teaspoons vegetable oil   1 tablespoon finely chopped garlic   1/2 teaspoon grated fresh ginger root   1/2 cup soy sauce   1/2 cup water,2/3 cup dark brown sugar   1 pound beef flank steak, sliced 1/4 inch thick on the diagonal   1/4 cup cornstarch   1 cup vegetable oil for frying   2 bunches green onions, cut in 2-inch lengths   Add all ingredients to list",
        "timetocook": "30 m",
        "instructions": "Prep12 m\n        \n                    \n                Cook8 m\n            \n                    \n                Ready In30 m\n            \n    \n\n\n            \n                        \n                            Heat 2 teaspoons of vegetable oil in a saucepan over medium heat, and cook and stir the garlic and ginger until they release their fragrance, about 30 seconds. Pour in the soy sauce, water, and brown sugar. Raise the heat to medium-high, and stir 4 minutes, until the sugar has dissolved and the sauce boils and slightly thickens. Remove sauce from the heat, and set aside.\n                            \n                        \n                        \n                            Place the sliced beef into a bowl, and stir the cornstarch into the beef, coating it thoroughly. Allow the beef and cornstarch to sit until most of the juices from the meat have been absorbed by the cornstarch, about 10 minutes.\n                            \n                        \n                        \n                            Heat the vegetable oil in a deep-sided skillet or wok to 375 degrees F (190 degrees C).\n                            \n                        \n                        \n                            Shake excess cornstarch from the beef slices, and drop them into the hot oil, a few at a time. Stir briefly, and fry until the edges become crisp and start to brown, about 2 minutes. Remove the beef from the oil with a large slotted spoon, and allow to drain on paper towels to remove excess oil.\n                            \n                        \n                        \n                            Pour the oil out of the skillet or wok, and return the pan to medium heat. Return the beef slices to the pan, stir briefly, and pour in the reserved sauce. Stir once or twice to combine, and add the green onions. Bring the mixture to a boil, and cook until the onions have softened and turned bright green, about 2 minutes.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Mongolian Beef I",
        "Title_link": "https://www.allrecipes.com/recipe/22625/mongolian-beef-i/?internalSource=recipe hub&referringId=695&referringContentType=Recipe Hub&clickId=cardslot 33",
        "Headline": "Mongolian Beef I",
        "description": "\"A simple but spicy dish with beef, carrots and green onions. Serve over rice for a very filling meal.\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/560x315/6263299.jpg",
            "https://images.media-allrecipes.com/userphotos/125x70/6263299.jpg"
        ],
        "ingredients": "1 teaspoon sesame seeds   1 tablespoon soy sauce   1 tablespoon cornstarch   2 cloves garlic, minced   1 pound beef round steak, cut into thin strips   3/4 cup water   2 tablespoons soy sauce,2 1/2 teaspoons cornstarch  1/2 teaspoon white sugar   1 teaspoon red pepper flakes   2 tablespoons vegetable oil, divided   2 carrots, thinly sliced   1 bunch green onions, cut into 2 inch pieces   Add all ingredients to list",
        "timetocook": "45 m",
        "instructions": "Prep35 m\n        \n                    \n                Cook10 m\n            \n                    \n                Ready In45 m\n            \n    \n\n\n            \n                        \n                            In a dry skillet over medium heat, toast sesame seeds for 1 to2 minutes, or until the seeds begin to turn golden brown; set aside.\n                            \n                        \n                        \n                            In a medium bowl, mix together 1 tablespoon soy sauce, 1 tablespoon cornstarch, and minced garlic. Stir in beef strips. Let stand for at least 10 minutes.\n                            \n                        \n                        \n                            In a separate small bowl, mix together water, 2 tablespoons soy sauce, 2 1/2 teaspoons cornstarch, sugar, sesame seeds, and red pepper flakes; set aside.\n                            \n                        \n                        \n                            Heat 1 tablespoon of oil in a wok or skillet over high heat. Cook and stir beef in hot oil for 1 minute; remove, and set aside. Heat remaining tablespoon of oil in the same pan. Saute carrots and white part of green onions for 2 minutes. Stir in green parts of the green onion, and saute for 1 minute. Stir in sesame seed mixture and beef. Cook and stir until sauce boils and thickens.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Mongolian Beef II",
        "Title_link": "https://www.allrecipes.com/recipe/26627/mongolian-beef-ii/?internalSource=recipe hub&referringId=695&referringContentType=Recipe Hub&clickId=cardslot 62",
        "Headline": "Mongolian Beef II",
        "description": "\"Savory strips of sirloin roast are soaked in a spicy marinade and sauteed with green onions. Serve over steamed rice or fried rice noodles.\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/560x315/297149.jpg",
            "https://images.media-allrecipes.com/userphotos/125x70/297149.jpg"
        ],
        "ingredients": "2 pounds boneless sirloin tip roast   1/2 cup soy sauce   2 tablespoons dry sherry   2 teaspoons sesame oil   3 tablespoons cornstarch,2 tablespoons brown sugar   2 teaspoons crushed red pepper   5 whole dried red chile peppers   3/8 cup vegetable oil, divided   4 bunches green onions, cut into 2 inch pieces   Add all ingredients to list",
        "timetocook": "1 h",
        "instructions": "Prep20 m\n        \n                    \n                Cook20 m\n            \n                    \n                Ready In1 h\n            \n    \n\n\n            \n                        \n                            Partially freeze the roast for easier slicing. Slice the roast into 3x1/2 inch strips, and set aside.\n                            \n                        \n                        \n                            In a large bowl, combine well the soy sauce, sherry, sesame oil, cornstarch, brown sugar, crushed red pepper and whole chile peppers. Place beef in the mixture and coat well. Cover and refrigerate for 20 to 30 minutes.\n                            \n                        \n                        \n                            Heat 2 tablespoons of the oil in a large skillet or wok over medium high heat. Place green onions in the hot oil. Cover, reduce heat to low and cook 6 minutes, or until tender. Remove green onions and set aside.\n                            \n                        \n                        \n                            In the same skillet or wok, heat remaining 1/4 cup of oil over medium high heat. Add beef mixture and saute for 5 minutes, or until the beef is thoroughly cooked. Return green onions to the pan and saute for 30 seconds more, or until heated through.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Pan-Fried Chinese Pancakes",
        "Title_link": "https://www.allrecipes.com/recipe/214564/pan-fried-chinese-pancakes/?internalSource=staff pick&referringId=695&referringContentType=Recipe Hub",
        "Headline": "Pan-Fried Chinese Pancakes",
        "description": "\"A delicious brunch snack that can be found in many Chinese breakfast shops.  Its various names include 'cong you bing,' 'jiu cai bing,', 'scallion pancakes,' 'green onion pancakes,' etc.  This particular recipe is passed down through my mother's family, and brings back many good, yummy memories! Can serve with hot-sour sauce, or your favorite Chinese sauce.\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/250x250/401958.jpg",
            "https://images.media-allrecipes.com/userphotos/125x70/401958.jpg"
        ],
        "ingredients": "1/4 teaspoon salt   3/4 cup warm water   1 cup all-purpose flour   1/4 teaspoon vegetable oil (optional)   1/4 cup all-purpose flour,1 tablespoon vegetable oil  1 tablespoon Asian (toasted) sesame oil, or as needed   1/2 cup finely chopped green onion   1 tablespoon vegetable oil, or as needed  Add all ingredients to list",
        "timetocook": "1 h 10 m",
        "instructions": "Prep30 m\n        \n                    \n                Cook40 m\n            \n                    \n                Ready In1 h 10 m\n            \n    \n\n\n            \n                        \n                            Dissolve salt in warm water, and mix in 1 cup of flour to make a soft dough. Turn the dough out onto a well-floured work surface, and knead until slightly springy, about 5 minutes. If the dough is sticky, knead in 1/4 teaspoon of vegetable oil. Divide the dough into 8 equal-size pieces, and keep the pieces covered with a cloth.\n                            \n                        \n                        \n                            In a bowl, mix 1/4 cup of flour with 1 tablespoon vegetable oil to make a mixture like fine crumbs.\n                            \n                        \n                        \n                            On a floured work surface, roll a piece of dough out into a thin square about 5x7 inches in size, brush the dough with toasted sesame oil, and sprinkle lightly with about 1 1/2 teaspoon of the flour-oil mixture. Sprinkle about 1 tablespoon of chopped green onion onto the dough, and spread the onion out evenly. Starting with a long end, roll the dough up into a rope shape, and pinch the seam and the ends closed. Roll the rope shape into a flat spiral, and press lightly with your hands to compact the spiral and keep it from unrolling.\n                            \n                        \n                        \n                            Place the spiral down onto the floured work surface, and gently roll it out into a pancake with the onions folded inside, turning the pancake over often as you roll it out. Roll gently and turn often to avoid making holes in the pancakes. Finished pancakes should be about 5 inches in diameter. Repeat with the rest of the dough pieces, making 8 onion pancakes.\n                            \n                        \n                        \n                            Heat a non-stick skillet over medium heat, and brush with vegetable oil. Pan-fry each pancake in the hot skillet until golden brown on both sides, about 5 minutes per side. Cut into wedges and serve warm.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Peking Duck",
        "Title_link": "https://www.allrecipes.com/recipe/31972/peking-duck/?internalSource=recipe hub&referringId=695&referringContentType=Recipe Hub&clickId=cardslot 78",
        "Headline": "Peking Duck",
        "description": "\"I have made this recipe and it is delicious. It can be served with plum sauce as well as a fruit sauce. This is actually a short-cut version but it is fantastic.\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/560x315/662217.jpg",
            "https://images.media-allrecipes.com/userphotos/125x70/662217.jpg"
        ],
        "ingredients": "1 (4 pound) whole duck, dressed   1/2 teaspoon ground cinnamon   1/2 teaspoon ground ginger   1/4 teaspoon ground nutmeg   1/4 teaspoon ground white pepper   1/8 teaspoon ground cloves   3 tablespoons soy sauce   1 tablespoon honey,1 orange, sliced in rounds   1 tablespoon chopped fresh parsley, for garnish   5 green onions   1/2 cup plum jam   1 1/2 teaspoons sugar   1 1/2 teaspoons distilled white vinegar   1/4 cup finely chopped chutney   Add all ingredients to list",
        "timetocook": "3 h 50 m",
        "instructions": "Prep15 m\n        \n                    \n                Cook1 h 35 m\n            \n                    \n                Ready In3 h 50 m\n            \n    \n\n\n            \n                        \n                            Rinse the duck inside and out, and pat dry. Cut off tail and discard. In a small bowl, mix together the cinnamon, ginger, nutmeg, white pepper and cloves. Sprinkle one teaspoon of the mixture into the cavity of the duck. Stir one tablespoon of the soy sauce into the remaining spice mixture and rub evenly over the entire outside of the bird. Cut one of the green onions in half and tuck inside the cavity. Cover and refrigerate the bird for at least 2 hours, or overnight.\n                            \n                        \n                        \n                            Place duck breast side up on a rack in a big enough wok or pot and steam for an hour adding a little more water, if necessary, as it evaporates. Lift duck with two large spoons, and drain juices and green onion.\n                            \n                        \n                        \n                            Preheat the oven to 375 degrees F (190 degrees C). Place duck breast side up in a roasting pan and prick skin all over using a fork.\n                            \n                        \n                        \n                            Roast for 30 minutes in the preheated oven. While the duck is roasting, mix together the remaining 2 tablespoons of soy sauce and honey. After 30 minutes, brush the honey mixture onto the duck and return it to the oven. Turn the heat up to 500 degrees F (260 degrees C). Roast for 5 minutes, or until the skin is richly browned. Do not allow the skin to char.\n                            \n                        \n                        \n                            Prepare the duck sauce by mixing the plum jam with the sugar, vinegar and chutney in a small serving bowl. Chop remaining green onions and place them into a separate bowl. Place whole duck onto a serving platter and garnish with orange slices and fresh parsley. Use plum sauce and onions for dipping.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Pineapple Fried Rice II",
        "Title_link": "https://www.allrecipes.com/recipe/56140/pineapple-fried-rice-ii/?internalSource=rotd&referringId=695&referringContentType=Recipe Hub",
        "Headline": "Pineapple Fried Rice II",
        "description": "\"Exotic flavors blend together to create this crowd-pleasing favorite. Contains pineapple, ham, peas, green onion and eggs.\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/250x250/384934.jpg",
            "https://images.media-allrecipes.com/userphotos/125x70/384934.jpg"
        ],
        "ingredients": "1 cup uncooked white rice   2 cups water   2 tablespoons sesame oil   3 green onions, thinly sliced including tops   1 cup diced ham   1/2 cup peas   1 (8 ounce) can pineapple chunks, drained,1 egg, beaten   1 tablespoon white sugar   1 teaspoon salt   1/2 teaspoon white pepper   1/2 teaspoon garlic powder   1/4 cup soy sauce   Add all ingredients to list",
        "timetocook": "1 h 5 m",
        "instructions": "Prep15 m\n        \n                    \n                Cook30 m\n            \n                    \n                Ready In1 h 5 m\n            \n    \n\n\n            \n                        \n                            Bring the rice and water to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the rice is tender, and the liquid has been absorbed, 20 to 25 minutes. Spread cooked rice out on a rimmed baking sheet and refrigerate until cooled, about 20 minutes.\n                            \n                        \n                        \n                            Heat sesame oil in a large skillet or wok over medium-high heat.  Cook and stir the green onions, ham, and peas in the hot oil until onions have softened, about 2 minutes. Stir the pineapple chunks into the wok; cook until pineapple begins to darken, about 2 minute.  Push ingredients to the side of the wok, and pour beaten egg in the center. Cook until egg begins to set, about 30 seconds. Stir together all contents of the wok.\n                            \n                        \n                        \n                            Mix the cooled rice, sugar, salt, white pepper, and garlic powder into the wok; stir constantly to keep from sticking. Cook until heated through, about 3 minutes. Sprinkle the rice with the soy sauce, and stir to combine.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Pineapple Fried Rice II",
        "Title_link": "https://www.allrecipes.com/recipe/56140/pineapple-fried-rice-ii/?internalSource=recipe hub&referringId=695&referringContentType=Recipe Hub&clickId=cardslot 52",
        "Headline": "Pineapple Fried Rice II",
        "description": "\"Exotic flavors blend together to create this crowd-pleasing favorite. Contains pineapple, ham, peas, green onion and eggs.\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/250x250/384934.jpg",
            "https://images.media-allrecipes.com/userphotos/125x70/384934.jpg"
        ],
        "ingredients": "1 cup uncooked white rice   2 cups water   2 tablespoons sesame oil   3 green onions, thinly sliced including tops   1 cup diced ham   1/2 cup peas   1 (8 ounce) can pineapple chunks, drained,1 egg, beaten   1 tablespoon white sugar   1 teaspoon salt   1/2 teaspoon white pepper   1/2 teaspoon garlic powder   1/4 cup soy sauce   Add all ingredients to list",
        "timetocook": "1 h 5 m",
        "instructions": "Prep15 m\n        \n                    \n                Cook30 m\n            \n                    \n                Ready In1 h 5 m\n            \n    \n\n\n            \n                        \n                            Bring the rice and water to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the rice is tender, and the liquid has been absorbed, 20 to 25 minutes. Spread cooked rice out on a rimmed baking sheet and refrigerate until cooled, about 20 minutes.\n                            \n                        \n                        \n                            Heat sesame oil in a large skillet or wok over medium-high heat.  Cook and stir the green onions, ham, and peas in the hot oil until onions have softened, about 2 minutes. Stir the pineapple chunks into the wok; cook until pineapple begins to darken, about 2 minute.  Push ingredients to the side of the wok, and pour beaten egg in the center. Cook until egg begins to set, about 30 seconds. Stir together all contents of the wok.\n                            \n                        \n                        \n                            Mix the cooled rice, sugar, salt, white pepper, and garlic powder into the wok; stir constantly to keep from sticking. Cook until heated through, about 3 minutes. Sprinkle the rice with the soy sauce, and stir to combine.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Potstickers (Chinese Dumplings)",
        "Title_link": "https://www.allrecipes.com/recipe/202975/potstickers-chinese-dumplings/?internalSource=recipe hub&referringId=695&referringContentType=Recipe Hub&clickId=cardslot 91",
        "Headline": "Potstickers (Chinese Dumplings)",
        "description": "\"An authentic potsticker recipe using ground beef and ground shrimp instead of the usual pork filling. You can fill the whole package of gyoza wrappers and have filling left over for next time around.\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/125x70/692888.jpg"
        ],
        "ingredients": "1 pound raw shrimp, peeled and deveined   4 pounds ground beef   1 tablespoon minced fresh ginger root   1 shallot, minced   1 bunch green onions, chopped   3 leaves napa cabbage, chopped   2 tablespoons soy sauce,1 teaspoon Asian (toasted) sesame oil   salt and white pepper to taste   1 pinch white sugar   1 (10 ounce) package round gyoza/potsticker wrappers   vegetable oil   1/4 cup water   Add all ingredients to list",
        "timetocook": "1 h 2 m",
        "instructions": "Prep50 m\r\n        \r\n                    \r\n                Cook12 m\r\n            \r\n                    \r\n                Ready In1 h 2 m\r\n            \r\n    \r\n\r\n\r\n            \r\n                        \r\n                            Place the shrimp in the work bowl of a food processor, and process until the shrimp are finely ground. Set aside in a large bowl. Working in batches, process the ground beef to a fine grind, and set aside with the shrimp. Combine the shrimp and ground beef with ginger, shallot, green onions, napa cabbage, soy sauce, sesame oil, salt and pepper, and white sugar, and mix the ingredients until thoroughly combined.\r\n                            \r\n                        \r\n                        \r\n                            To fill the pot stickers, place a wrapper on a work surface in front of you, and place a scant teaspoon of filling in the center. With a wet finger, dampen the edges of the wrapper. Fold the dough into a half-moon shape, enclosing the filling, and press and seal to remove extra air and tightly seal the edges together. It's nice to fold several small pleats in the top half of the wrapper for a traditional look before you seal in the filling. Refrigerate the filled wrappers on a parchment-lined baking sheet while you finish filling and sealing the pot stickers.\r\n                            \r\n                        \r\n                        \r\n                            Heat the oil in a large nonstick skillet with a lid over medium heat. Place pot stickers into the hot oil, flat sides down, without crowding, and let fry until the bottoms are golden brown, 1 to 2 minutes. Turn the dumplings over, and pour the water over them. Cover the pan with a lid and let the dumplings steam until the water has nearly evaporated and the dumplings have begun to fry in oil again, 5 to 7 minutes. Uncover the skillet, and let the pot stickers cook until all the water is evaporated and the wrapper has shrunk down tightly onto the filling, another 2 to 3 minutes.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Quick Beef Stir-Fry",
        "Title_link": "https://www.allrecipes.com/recipe/228823/quick-beef-stir-fry/?internalSource=recipe hub&referringId=695&referringContentType=Recipe Hub&clickId=cardslot 29",
        "Headline": "Quick Beef Stir-Fry",
        "description": "\"Quick and easy. I make this on my busiest weeknights.\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/125x70/6263320.jpg"
        ],
        "ingredients": "2 tablespoons vegetable oil   1 pound beef sirloin, cut into 2-inch strips   1 1/2 cups fresh broccoli florets   1 red bell pepper, cut into matchsticks   2 carrots, thinly sliced,1 green onion, chopped   1 teaspoon minced garlic   2 tablespoons soy sauce   2 tablespoons sesame seeds, toasted   Add all ingredients to list",
        "timetocook": "25 m",
        "instructions": "Prep15 m\n        \n                    \n                Cook10 m\n            \n                    \n                Ready In25 m\n            \n    \n\n\n            \n                        \n                            Heat vegetable oil in a large wok or skillet over medium-high heat; cook and stir beef until browned, 3 to 4 minutes. Move beef to the side of the wok and add broccoli, bell pepper, carrots, green onion, and garlic to the center of the wok. Cook and stir vegetables for 2 minutes.\n                            \n                        \n                        \n                            Stir beef into vegetables and season with soy sauce and sesame seeds. Continue to cook and stir until vegetables are tender, about 2 more minutes.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Quick Chinese-Style Vermicelli (Rice Noodles)",
        "Title_link": "https://www.allrecipes.com/recipe/41761/quick-chinese-style-vermicelli-rice-noodles/?internalSource=recipe hub&referringId=695&referringContentType=Recipe Hub&clickId=cardslot 57",
        "Headline": "Quick Chinese-Style Vermicelli (Rice Noodles)",
        "description": "\"Quick and delicious Chinese-style rice noodles.\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/250x250/491687.jpg",
            "https://images.media-allrecipes.com/userphotos/125x70/491687.jpg"
        ],
        "ingredients": "1 (8 ounce) package dried rice noodles   2 tablespoons vegetable oil   1 clove garlic, minced   1 tablespoon soy sauce,1/2 tablespoon chili sauce   salt and pepper to taste   1 green onion, chopped   Add all ingredients to list",
        "timetocook": "18 m",
        "instructions": "Prep15 m\n        \n                    \n                Cook3 m\n            \n                    \n                Ready In18 m\n            \n    \n\n\n            \n                        \n                            Bring a large pot of water to a boil. Add rice noodles, and cook for 2 to 3 minutes or until al dente; do not overcook, or they will become mushy. Drain.\n                            \n                        \n                        \n                            Heat oil in a large skillet over medium heat. Saute garlic until tender. Stir in noodles, and season with soy sauce, chili sauce, salt and pepper. Sprinkle top with chopped green onion.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Restaurant Style Egg Drop Soup",
        "Title_link": "https://www.allrecipes.com/recipe/45515/restaurant-style-egg-drop-soup/?internalSource=hub recipe&referringId=695&referringContentType=Recipe Hub",
        "Headline": "Restaurant Style Egg Drop Soup",
        "description": "\"This Egg Drop soup is born from a love of the soup and MANY trips to my favorite Chinese restaurant (asking them many questions) resulting in this variation. Compare it to your local restaurant...The simplicity is the key. Soup can be re-heated or frozen and re-heated.\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/125x70/4486830.jpg"
        ],
        "ingredients": "4 cups chicken broth, divided   1/8 teaspoon ground ginger   2 tablespoons chopped fresh chives   1/4 teaspoon salt,1 1/2 tablespoons cornstarch   2 eggs   1 egg yolk   Add all ingredients to list",
        "timetocook": "20 m",
        "instructions": "Prep10 m\n        \n                    \n                Cook10 m\n            \n                    \n                Ready In20 m\n            \n    \n\n\n            \n                        \n                            Reserve 3/4 cup of chicken broth, and pour the rest into a large saucepan. Stir the salt, ginger and chives into the saucepan, and bring to a rolling boil. In a cup or small bowl, stir together the remaining broth and cornstarch until smooth. Set aside.\n                            \n                        \n                        \n                            In a small bowl, whisk the eggs and egg yolk together using a fork. Drizzle egg a little at a time from the fork into the boiling broth mixture. Egg should cook immediately. Once the eggs have been dropped, stir in the cornstarch mixture gradually until the soup is the desired consistency.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Slow Cooker Mongolian Beef",
        "Title_link": "https://www.allrecipes.com/recipe/195083/slow-cooker-mongolian-beef/?internalSource=hub recipe&referringId=695&referringContentType=Recipe Hub",
        "Headline": "Slow Cooker Mongolian Beef",
        "description": "\"I got this recipe from a friend and it is wonderful.  My kids love it.  It tastes like you got it at a Chinese restaurant and the slow cooker does most of the work! Serve over steamed rice.\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/250x250/374059.jpg",
            "https://images.media-allrecipes.com/userphotos/125x70/374059.jpg"
        ],
        "ingredients": "1 pound flank steak, cut into bite-size pieces   1/4 cup cornstarch   2 teaspoons olive oil   1 onion, thinly sliced   1 tablespoon minced garlic   3 large green onions, sliced diagonally into 1/2 inch pieces,1/2 cup soy sauce   1/2 cup water   1/2 cup brown sugar   1/2 teaspoon minced fresh ginger root   1/2 cup hoisin sauce   Add all ingredients to list",
        "timetocook": "4 h 30 m",
        "instructions": "Prep10 m\n        \n                    \n                Cook4 h 10 m\n            \n                    \n                Ready In4 h 30 m\n            \n    \n\n\n            \n                        \n                            Place flank steak and cornstarch into a resealable plastic bag. Shake the bag to evenly coat the flank steak with the cornstarch. Allow to steak rest for 10 minutes.\n                            \n                        \n                        \n                            Heat olive oil in a large skillet over medium-high heat. Cook and stir steak until evenly browned, 2 to 4 minutes. Place onion, garlic, flank steak, green onions, soy sauce, water, brown sugar, ginger, and hoisin sauce in a slow cooker. Cook on Low setting for about 4 hours.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Spicy Crispy Beef",
        "Title_link": "https://www.allrecipes.com/recipe/23420/spicy-crispy-beef/?internalSource=recipe hub&referringId=695&referringContentType=Recipe Hub&clickId=cardslot 42",
        "Headline": "Spicy Crispy Beef",
        "description": "\"I've never found a recipe for crispy ginger beef like the ones in the restaurants. I have experimented, and found something pretty close. Serve with rice and some steamed veggies.\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/560x315/2621678.jpg",
            "https://images.media-allrecipes.com/userphotos/125x70/2621678.jpg"
        ],
        "ingredients": "1/4 cup cornstarch   1/4 tablespoon salt   black pepper   12 ounces flank steak, thinly sliced   1 quart oil for frying   4 tablespoons soy sauce   1 tablespoon rice vinegar   1/2 tablespoon rice wine   1 1/2 tablespoons honey,7 tablespoons granulated sugar   1/2 tablespoon chile paste   1/4 cup water   3 tablespoons chopped fresh ginger root   1 tablespoon vegetable oil   2 cloves garlic, chopped   1/4 cup sliced onion   1/4 cup diced red bell pepper   Add all ingredients to list",
        "timetocook": "45 m",
        "instructions": "Prep20 m\n        \n                    \n                Cook20 m\n            \n                    \n                Ready In45 m\n            \n    \n\n\n            \n                        \n                            Heat oil in deep-fryer to 375 degrees F (190 degrees C).\n                            \n                        \n                        \n                            Meanwhile, in a mixing bowl, combine cornstarch, salt and pepper together. Mix thoroughly. Toss the steak slices in the cornstarch mixture and coat well.\n                            \n                        \n                        \n                            Deep fry the coated steak slices until golden brown. Check to make sure they are cooked through. Remove from oil, and set aside.\n                            \n                        \n                        \n                            In another mixing bowl, combine the soy sauce, rice vinegar, rice wine and honey. Add sugar, chili paste, water, and ginger. Mix well and set aside.\n                            \n                        \n                        \n                            Heat a wok or deep frying pan over medium high heat. Add 1 tablespoon of oil, and quickly saute the onion, garlic and red pepper for 30 seconds. Add the sauce mixture, and cook another 30 seconds. Finally, add the strips of fried steak and toss to heat through and coat with sauce.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Spicy Orange Zest Beef",
        "Title_link": "https://www.allrecipes.com/recipe/221127/spicy-orange-zest-beef/?internalSource=recipe hub&referringId=695&referringContentType=Recipe Hub&clickId=cardslot 70",
        "Headline": "Spicy Orange Zest Beef",
        "description": "\"This spicy orange zest beef recipe is not supposed to be Chinese food, or even Americanized Chinese take-out food. It is a lower-fat alternative while still a quick, easy, and surprisingly flavorful meal.\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/125x70/5670410.jpg"
        ],
        "ingredients": "1 pound beef tenderloin, cut into 1/2 inch strips   1/4 cup orange juice   1/4 cup seasoned rice vinegar   2 tablespoons soy sauce   1 tablespoon hot chile paste (such as sambal oelek)   1 tablespoon brown sugar, or to taste   2 cloves garlic, minced,1/4 cup water   1 teaspoon cornstarch   cooking spray   2 tablespoons grated orange zest   1 bunch green onions, sliced - white parts and tops separated   salt and freshly ground black pepper to taste   Add all ingredients to list",
        "timetocook": "2 h",
        "instructions": "Prep20 m\n        \n                    \n                Cook5 m\n            \n                    \n                Ready In2 h\n            \n    \n\n\n            \n                        \n                            Combine beef, orange juice, rice vinegar, soy sauce, hot chili paste, brown sugar, and garlic in a large bowl. Cover and refrigerate for 1 to 2 hours.\n                            \n                        \n                        \n                            Strain beef in a colander set over a large bowl, allowing beef to drain thoroughly, about 5 minutes. Reserve marinade.\n                            \n                        \n                        \n                            Stir water and cornstarch into the bowl of marinade. Whisk until cornstarch is dissolved, set aside.\n                            \n                        \n                        \n                            Spray skillet with cooking spray and place over high heat. Cook beef for 1 minute without stirring; cook and stir for an additional minute.\n                            \n                        \n                        \n                            Stir in light parts of green onion and orange zest; cook for 30 seconds.\n                            \n                        \n                        \n                            Stir in marinade and green onion tops; cook and stir until beef is no longer pink inside and sauce is reduced and thick, about 2 to 3 minutes.\n                            \n                        \n                        \n                            Season with salt and black pepper to taste.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Steamed Fish with Ginger",
        "Title_link": "https://www.allrecipes.com/recipe/140570/steamed-fish-with-ginger/?internalSource=recipe hub&referringId=695&referringContentType=Recipe Hub&clickId=cardslot 74",
        "Headline": "Steamed Fish with Ginger",
        "description": "\"If you like fish or even anything about Chinese food you'll love this recipe.\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/560x315/1257557.jpg",
            "https://images.media-allrecipes.com/userphotos/125x70/1257557.jpg"
        ],
        "ingredients": "1 pound halibut fillet   1 teaspoon coarse sea salt or kosher salt   1 tablespoon minced fresh ginger   3 tablespoons thinly sliced green onion   1 tablespoon dark soy sauce,1 tablespoon light soy sauce   1 tablespoon peanut oil   2 teaspoons toasted sesame oil   1/4 cup lightly packed fresh cilantro sprigs   Add all ingredients to list",
        "timetocook": "25 m",
        "instructions": "Prep15 m\n        \n                    \n                Cook10 m\n            \n                    \n                Ready In25 m\n            \n    \n\n\n            \n                        \n                            Pat halibut dry with paper towels.  Rub both sides of fillet with salt. Scatter the ginger over the top of the fish and place onto a heatproof ceramic dish.\n                            \n                        \n                        \n                            Place into a bamboo steamer set over several inches of gently boiling water, and cover. Gently steam for 10 to 12 minutes.\n                            \n                        \n                        \n                            Pour accumulated water out of the dish and sprinkle the fillet with green onion.  Drizzle both soy sauces over the surface of the fish.\n                            \n                        \n                        \n                            Heat peanut and sesame oils in a small skillet over medium-high heat until they begin to smoke. When the oil is hot, carefully pour on top of the halibut fillet. The very hot oil will cause the green onions and water on top of the fish to pop and spatter all over; be careful. Garnish with cilantro sprigs and serve immediately.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Super-Simple, Super-Spicy Mongolian Beef",
        "Title_link": "https://www.allrecipes.com/recipe/148831/super-simple-super-spicy-mongolian-beef/?internalSource=hub recipe&referringId=695&referringContentType=Recipe Hub",
        "Headline": "Super-Simple, Super-Spicy Mongolian Beef",
        "description": "\"This is a great-tasting recipe that is easy to prepare ahead and takes minutes to actually cook it! Serve with rice and veggie side for a nice family dinner!\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/560x315/385999.jpg",
            "https://images.media-allrecipes.com/userphotos/125x70/385999.jpg"
        ],
        "ingredients": "1/4 cup soy sauce   1 tablespoon hoisin sauce   1 tablespoon sesame oil   2 teaspoons white sugar   1 tablespoon minced garlic,1 tablespoon red pepper flakes (optional)   1 pound beef flank steak, thinly sliced   1 tablespoon peanut oil   2 large green onions, thinly sliced   Add all ingredients to list",
        "timetocook": "1 h 21 m",
        "instructions": "Prep15 m\n        \n                    \n                Cook6 m\n            \n                    \n                Ready In1 h 21 m\n            \n    \n\n\n            \n                        \n                            Whisk together soy sauce, hoisin sauce, sesame oil, sugar, garlic, and red pepper flakes in a bowl. Toss beef with marinade, cover, and refrigerate 1 hour to overnight.\n                            \n                        \n                        \n                            Heat peanut oil in a wok or large, nonstick skillet over high heat. Add the green onions, and cook for 5 to 10 seconds before stirring in the beef. Cook and stir until the beef is no longer pink and is beginning to brown, about 5 minutes.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Sweet and Sour Pork Tenderloin",
        "Title_link": "https://www.allrecipes.com/recipe/222342/sweet-and-sour-pork-tenderloin/?internalSource=recipe hub&referringId=695&referringContentType=Recipe Hub&clickId=cardslot 37",
        "Headline": "Sweet and Sour Pork Tenderloin",
        "description": "\"I thoroughly enjoyed this plate of florescent food, and if you're a fan of the Chinese take-out version, I believe you will enjoy this too.\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/125x70/963795.jpg"
        ],
        "ingredients": "1 (1 1/4 pound) pork tenderloin, trimmed of silver skin   salt and ground black pepper   1/3 cup ketchup   1/3 cup seasoned rice vinegar   1 (8 ounce) can pineapple chunks, drained with juice reserved   2 tablespoons brown sugar   4 cloves garlic, minced,2 teaspoons hot chili sauce (such as Sriracha®)   1 teaspoon soy sauce   1 pinch red pepper flakes   1 tablespoon vegetable oil   1 teaspoon butter   1/4 cup chopped green onion (white part only)   2 tablespoons chopped green onion tops  Add all ingredients to list",
        "timetocook": "55 m",
        "instructions": "Prep20 m\n        \n                    \n                Cook35 m\n            \n                    \n                Ready In55 m\n            \n    \n\n\n            \n                        \n                            Cut tenderloin into 4 pieces. Arrange in a single layer between two sheets of plastic wrap and pound with a meat mallet until each is about 1-inch thick. Generously season with salt and black pepper.\n                            \n                        \n                        \n                            Whisk ketchup, rice vinegar, reserved pineapple juice, brown sugar, garlic, hot chili sauce, soy sauce, and red pepper flakes in a bowl. Set aside.\n                            \n                        \n                        \n                            Heat vegetable oil in a skillet over high heat. Place pork in pan; reduce heat to medium. Cook until browned on both sides and cooked through, 5 to 6 minutes per side. Transfer to a plate.\n                            \n                        \n                        \n                            Return skillet to medium heat. Stir butter into hot pan. When butter melts and starts to brown, stir in pineapple chunks. Cook, stirring, until pineapple is golden brown, 3 to 4 minutes.\n                            \n                        \n                        \n                            Stir in ketchup mixture and 1/4 cup green onion (white parts). Reduce heat to low and simmer until garlic and onion have softened, 5 minutes.\n                            \n                        \n                        \n                            Return pork to skillet; cook, stirring, until pork is heated through. Garnish with 2 tablespoons green onion tops.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Szechuan Beef",
        "Title_link": "https://www.allrecipes.com/recipe/20095/szechuan-beef/?internalSource=recipe hub&referringId=695&referringContentType=Recipe Hub&clickId=cardslot 48",
        "Headline": "Szechuan Beef",
        "description": "\"It is spicy! Serve with rice.\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/560x315/303105.jpg",
            "https://images.media-allrecipes.com/userphotos/125x70/303105.jpg"
        ],
        "ingredients": "1 pound sirloin steak, cut into bite size strips   1 tablespoon soy sauce   2 teaspoons cornstarch   1/4 teaspoon crushed red pepper   1 clove garlic, minced   2 tablespoons vegetable oil,3 cups fresh broccoli florets   2 small onions, cut into wedges   1 (8 ounce) can water chestnuts, drained   1/4 cup chicken broth   1/2 cup peanuts   Add all ingredients to list",
        "timetocook": "40 m",
        "instructions": "Prep10 m\n        \n                    \n                Cook10 m\n            \n                    \n                Ready In40 m\n            \n    \n\n\n            \n                        \n                            Toss beef with soy sauce, cornstarch, crushed red pepper and garlic in non-metal bowl.  Cover and refrigerate 20 minutes.\n                            \n                        \n                        \n                            Heat oil in wok or large skillet over high heat.  Stir fry beef until no longer pink, 5 minutes.  Stir in broccoli, onions and water chestnuts; cook 2 minutes.  Pour in broth, and bring to a boil.  Stir in peanuts, cook one minute more, and serve.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Szechwan Shrimp",
        "Title_link": "https://www.allrecipes.com/recipe/86230/szechwan-shrimp/?internalSource=hub recipe&referringId=695&referringContentType=Recipe Hub",
        "Headline": "Szechwan Shrimp",
        "description": "\"Don't let some of the ingredients fool you--this spicy shrimp makes a simple, impressive dish, which I usually make for company. For more or less heat, adjust amount of red pepper. Serve over hot steamed rice.\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/125x70/1052895.jpg"
        ],
        "ingredients": "4 tablespoons water   2 tablespoons ketchup   1 tablespoon soy sauce   2 teaspoons cornstarch   1 teaspoon honey   1/2 teaspoon crushed red pepper,1/4 teaspoon ground ginger   1 tablespoon vegetable oil   1/4 cup sliced green onions   4 cloves garlic, minced   12 ounces cooked shrimp, tails removed   Add all ingredients to list",
        "timetocook": "20 m",
        "instructions": "Prep10 m\n        \n                    \n                Cook10 m\n            \n                    \n                Ready In20 m\n            \n    \n\n\n            \n                        \n                            In a bowl, stir together water, ketchup, soy sauce, cornstarch, honey, crushed red pepper, and ground ginger. Set aside.\n                            \n                        \n                        \n                            Heat oil in a large skillet over medium-high heat. Stir in green onions and garlic; cook 30 seconds. Stir in shrimp, and toss to coat with oil. Stir in sauce. Cook and stir until sauce is bubbly and thickened.",
        "cuisine": "Chinese"
    },
    {
        "Title": "Vegetable Lo Mein",
        "Title_link": "https://www.allrecipes.com/recipe/11747/vegetable-lo-mein/?internalSource=recipe hub&referringId=695&referringContentType=Recipe Hub&clickId=cardslot 43",
        "Headline": "Vegetable Lo Mein",
        "description": "\"A great accompaniment to any Asian meal. Try adding 3/4 pound cooked meat for variety.\"",
        "image": [
            "https://images.media-allrecipes.com/userphotos/560x315/43208.jpg",
            "https://images.media-allrecipes.com/userphotos/125x70/43208.jpg"
        ],
        "ingredients": "8 ounces uncooked spaghetti   1/4 cup vegetable oil   2 cups fresh sliced mushrooms   1 cup shredded carrots   1/2 cup sliced red bell peppers   1 onion, chopped   2 cloves garlic, minced   2 cups fresh bean sprouts   1/2 cup chopped green onions,1 tablespoon cornstarch   1 cup chicken broth   1/4 cup hoisin sauce   2 tablespoons honey   1 tablespoon soy sauce   1 teaspoon grated fresh ginger   1/4 teaspoon cayenne pepper   1/4 teaspoon curry powder   Add all ingredients to list",
        "timetocook": "35 m",
        "instructions": "Prep10 m\n        \n                    \n                Cook25 m\n            \n                    \n                Ready In35 m\n            \n    \n\n\n            \n                        \n                            Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\n                            \n                        \n                        \n                            Heat oil in a large wok or saute pan. Stir fry mushrooms, carrots, peppers, onion and garlic until tender. Stir in bean sprouts and green onions; cook one minute. Mix cornstarch and chicken broth in a small bowl and add to stir fry. Stir in hoisin sauce, honey, soy sauce, ginger, cayenne pepper and curry powder. Cook and stir until thickened and bubbly.\n                            \n                        \n                        \n                            Add cooked spaghetti, and toss. Serve immediately.",
        "cuisine": "Chinese"
    }
]